delegateTransferAndCall
importInvestments
MINION
rightChild
UsingValidator
userTotalAmtWithdrawalCurrentPack
110
users
TransferChildEvent
plyr
ERC721Metadata
]
!registry
posDelta
presenter
owns
pvtTokens
0
_adviser
NextPackYield
87
_invest
ethToPay
getEscapeHatchForSmartWallet
_open
Universal
external
discord"
ptr
total
transferFeeDenominator
refundAllMoney
getCustomActionID
7
delegateDecreaseApproval
voteTimesStorage
WEAPON
seconds
_transferable
packCount
num
setIco3Tokens
DAI
\n32"
earned
sendValue
contract"
an
buyXname
_openTime
System"
sendEtherToNewContract
userSignature
importInvestor
overallRefunded
property
depositWithAdviser
LogNote
NewItem
0xA3Ad4EFDd5719eAed1B0F2e12c0D7368a6D11037
registeredAddress
*
DSTokenBase
enum
transferAllArgsYesAllowance
getTimeLeft
success
depositedAmount
raisePrice
x
_fromToken
DisableEscapeHatch
mana
marketFactory
DharmaSmartWalletImplementationV6
0x78
burnAll
trueUSD
FTN
packSize
"cDAI"
arrayLength
UserCycle
with
etherToSendCharity
redeem
_affCode
"PASS"
60
setVoteCounter
finishImporting
getDailyIncomeForUser
setDirectDebit
!seasonTradable
mulDiv
_includeReferralBonus
"PEG"
_burnFeeNumerator
has
onlyCurrentOwner
_pID
else
addition
}
_createCard
using
getTokenBalance
JTN
_message
medianiser
53
Wesion
entry
100"
tokenWallet
"Underlying"
isYes
potAmount
check
changeStaker
_idHash
"!value"
userTokensReturnToCurrentPack
_fstkAuthority
operationsEthWallet
gave
0x9C0ccB765D3f5035f8b5Dd30fE375d5F4997D8E4
approve
allowanceOf
MAX_MINT_NUMBER
policyGroup
_attribute
_storage
uint256
purchaseCount
signing
not
onlyPendingProxyOwner
nonce
EternalStorage
0x0000000000000000000000000000000000000000
!ok
currentVoteValue
makeTradeable
setMetadata0
onlyWhileOpen
?
_availableLimit
66
8680500000
149999843750000
priceFeedAdjustment
0xA0aE338E9FC22DE613CEC2d79477877f02751ceb
0x140000000000000000000000000000000000000000
overallWithdrawals
withdrawn
setKycAddress
finishMinting
removeVote
getEscapeHatch
disabled
setMarketGroup
dividendsOf
||
getPlayerInfoByAddress
"addition
tokenSendFailures
"Fire"
changeStakingFees
tokenOfOwnerByIndex
removeAdminList
2
tokenSymbol
69
_swapSaiForDai
cast
refund
airDropPot
finishPaySystemCommission
returnAmount
NFT
approveChecking
receiveApproval
TournamentPass
nums
caller
be
F3DKeysCalcShort
while
indexed
supportsInterface
""
noFeesList
setAllocator
uint80
stakingFee
yesPoint
onBuyAndDistribute
SafeMath
safeMul
numerator
isValid
Withdrawn
DistrFinished
isNewPlayer
setWithdraw
approveAndCall
SetupDirectDebit
SAIWithdrawal
DelegateERC20
cardIDs
propertyGroup
replaceProto
setPropertyFactory
"this
tokenAddress
userContinued
increaseNonce
tokenPerETH
ChangeWhiteList
manas
_processPurchase
experimental
icoPreEnded
_target3
_datas
senderInstrument
setIco1Tokens
now
1e18
preSaleTokens
kycAddress
_transferOwnership
_extraData
window
timeStamp
99
revokeAccess
938
source
goldToken
false
0xa0
percent
myDividends
p
base
_args5
allowed
dailyIncomeWithrewAmount
setDelegatedFrom
_keys
CardProto
"2
ERC1271
sellPrice
rewardRate
getStorageAddress
terminateDirectDebit
messageHash
withdraw
GozePayToken
"FTN"
100000000000000000
"Auction
UserContinued
medianiserAddress
manager
newMax
nameFilter
CurrentPackNumber
caller_
event
currently
100000000000000000000000000000
_DHARMA_SMART_WALLET_VERSION
GenericAtomicBatch
_cap
leftSell
claimAddress
compoundError
0xF9BaaA91e617dF1dE6c2386b789B401c422E9AB1
zero"
SetDelegatedFromEvent
modularShort
_hardCap
200
Deflate
mint
depositedValue
onPotSwapDeposit
putPresentee
power
oldSpecificKey
investmentIds
onlyTokenContract
0x721Ea19D5E96eEB25c6e847F3209f3ca82B41CC9
infraEthWallet
0xa6933dbb41d1bc3d681619c11234027db3b75954220aa88dfdc74750053ed30c
SetLiquid
UserBuyTokenPrevPack
burnAddr
BrickFinalized
leftover
nextContributorIndex
affiliateName
guy
0x98626E2C9231f03504273d55f397409deFD4a093
updateVote
allTokens
succeed"
teamtoken
setAdmin2
interval
_status
numberOfRounds
isLiquid
tokens_
rarities
setBool
000000001
generation
dailyIncome
aff
Dai
saleRate
multisend
getLimit
setMarketFactory
_codeLength
onlyBenefeciary
getApproved
_paySystemCommissionTimes
"SuperCard
founded
TradeHelperInterface
acceptChangeWithdrawAddress
did
_goal
onNewName
PlayerBook
ActionType
ico3Tokens
exchange
_validateCustomActionTypeAndGetArguments
deposited
0x488E0369f9BC5C40C002eA7c1fe4fd01A198801c
46
totalReward
_other
amountReceivedPEG
_earnings
transferAllFrom
_aff
getPEG
_aff_2
setVoteCounterStorage
Create
isValidSignature
receivePlayerInfo
receivePlayerNameList
isKYCRequiredToSendTokens
DirectDebit
newAddress
NewProtoCard
distr
returndata
_rewardDistribution
onlyAdminOrOwner
stakingRequirement
Deposit
limit"
UserWithdrawalFromFirstRefunded
approval
85
enableRefunds
setLockupStorage
WipedAccount
IPropertyFactory
getCurrentVote
_msgData
0x00000000008943c65cAf789FFFCF953bE156f6f8
card
seasonTradabilityLocked
_tradeDDaiForDUSDCAtomic
daiExpected
tokensIssuedViewOnly
LogBurn
signaturesInMemory
_eventData_
''
amount
Vault
amountMinted
TradeDDaiForDUSDC
getPlayerVaults
externalIDs
mustBeImporting
51
_COMPOUND_SUCCESS
DharmaSmartWalletImplementationV9Interface
UserTotalAmtWithdrawal
investmentLength
registerNameXaddr
8000000
ownedItems
_withdrawMaxFromCompound
maxOuts
remaining
ERC1271Interface
Funds
witCP
config
_tokenContract
rewardPerToken
foo
purchaseEthereum
stoppable
digest
nextPack
ether
newOwner
Refunding
safeSub
_incomingEthereum
mainSaleHasEnded
156250000
AddressExtension
!vipMap
_deliverTokens
_addToken
createVote
ChangeNameEvent
decode
delegateBalanceOf
_CSAI
wmax
"Jiggs"
hasMintPermission
amtToSend
minLevel
setUint
50000
abi
rndTmEth_
isLeft
USDCBorrow
migrateCSaiToDDai
0x08
delegateToNewContract
feedPrice
public
sendEtherForInvestor
!owns
selfdestruct
_enforceSelfCallFrom
icoPreRate
ico3Rate
setActivity
setOperator
investor
mythic
pay
981615
"GU
"Ether
_lastReset
_checkCompoundInteractionAndLogAnyErrors
coins
maxOutTimesInWeek
purchaseInternal
can
commission
rateInCents
400000
"UAP"
amountReceivedEther
mapping
000000000001
_addedValue
safeApprove
_getLegendaryPlusRarity
burnFrom
getNow
LENGTH"
cycle
Rare
policySet
authenticateFromPropertyFactory
tokensCount
200000000000000000000000000000000
packsPerClaim
by
stop
output
_supply
setWesionAddress
_burnFeeFlat
userSellDate
==
&&
_datasIndexes
nextBranch
memory
internal
:
protoCount
setPrices
investment
valid
ico
_price
RefundsEnabled
error
returndatasize
IMultiToken
operation
Unpause
bonusAmount
operationFund
_validateUserSignature
function
0x00000000005280B515004B998a944630B6C663f8
PackOpened
hasStarted
Token"
confirmSetIssuer
NewGlobalKey
"Tiger"
contract
target
allowances
configAddress
setIco2Tokens
userBuyTokenPrevPack
BrickCrowdsale
_ico3Tokens
"PEG
upper
ico1Tokens
storage
bhash
length
increaseAllowance
PrevPackTokenPriceSellout
5624988281256103515625000000000000000000000000000000000000000000
_args2
SignatureVerification
_foundersKey
getEthForDaiActionID
deauthenticate
_amount
userSigningKey
USDCWithdrawal
_source
have
LogRegister
initialize
IProperty
assert
_transferFeeDenominator
SetERC20ApproveChecking
>
MedianiserInterface
bad
!presenter
_tokenAmounts
"SafeERC20
getSellThisMonthLevel
getInvestmentsLength
low"
afterDeadline
_sellKeys
investmentValue
50000000000000
callback
_onList
_refund
0x0D7629d32546CD493bc33ADEF115D4489f5599Be
gaslimit
--
HasNoTokens
_issuer
containing
timestamp
validateGroups
0x2f22dC7eA406B14EC368C2d4875946ADFd02450e
_curEth
_identifier
updateSale
SetOpen
DAIBorrow
bar
_closingTime
MintFinished
54
selfCallContext
token
State
StandardDelegate
OwnershipTransferred
interfaceID
PrevPackTotalAmt
PlayerRounds
MultiBuyer
forSale
nonZeroPurchase
getContractInfo
_balance
key
claimRefund
16
attacks
endPvtSale
_pot
userRewardPerTokenPaid
spaces"
totalSupply
_isContract
_who
max
20
allocatorStorage
enabled"
rejected
unpaidDailyIncome
endIcoSaleRound1
_
RewardPaid
canDistr
importMoreWithdrawals
tokenRecipient
ONE_DAY
reLoadXaddr
humans
getAddress
isDelegateEnable
TimeLockedController
_MIGRATOR
onlyFsTKAuthorized
roundID
%
<=
endIcoSaleRound3
minter
parameter
stopGame
f
79
_softCapInEthers
radd
BTT
behavior
_affID_3
payToReachMaxOut
totalValue
proxyOwnerPosition
0x5b
setFsTKAuthority
getPeriodFinish
Purchase
setSpecificKey
true
legendary
canDelegate
imax
Rezurrection"
nonceOf
allowance"
_property
JiggsRezurrection
getUserSigningKey
1000000000000000000000000000000000
0x39
852940
23
CurrentPackDelta
Distr
withdrawEarnings
weiRaised
debtors
SetMetadata
approveAll
canCall
msg
supply
getInvestorsByIndex
endTime
_storageAddress
_winPID
_getCommonPlusRarity
3600
user
changeBurnBounds
4
s
0xF5DCe57282A584D2746FaF1593d3121Fcac444dC
ExternalError
what
stakeToken
revertReasonBytes
setPolicySet
bonusTokensReturnDecrease
illegal
setPolicyGroup
upgradeTo
"1
addToWhitelist
periodFinish
days
useItem
0x58709042d6c9a2b64c8e7802bfedabdcd2eaecc68e15ef2e896a5970c608cd16
claimAll
transferTokenOwnership
coinbase
fees_
72
transferAdminship
!protos
setString
protoRandom
Limit
Authorizable
epoch
70
setMetricsGroup
userTokensReturn
totalVipStake
val
blacklist
unable
any
allTokensDecimalsBalancesWeights
Registry
ContributorData
freeze
totalRemaining
newContract
toPayable
ReclaimEvent
returned
setOpen
_investor
Uniting
airDropTracker_
20000000
_team
SetDelegate
claimProxyOwnership
_burn
mintFinalize
getEther
"subtraction
"Address
recover
22
_pvtTokens
onEndTx
isHuman
reLoadCore
isContract
>=
resetMaxOutInWeek
unpaidDailyIncomes
CallReturn
transferable
_USDC_NAUGHTY
Pausable
dToken
sheet
rightSell
useFromFirstRefunded
_mul
"FOTON"
_initReentrancyGuard
_resolver
"only
IRewardDistributionRecipient
profitPerShare_
transferFromAndCall
transferChild
payDailyIncomeForInvestor
pot
FsTKToken
rndGap_
freezeAccount
cap
"oracle
amountToPay
hasStorage
newVoteValue
100000000000000
getBalances
resetGame
onlyGovernor
getCardDetails
wsub
mask
getVoteShare
interface
DelegateEvent
timeBetweenPriceAdjustments
newValue
priceETH_USD
mintingFinished
User
PrevPackCost
debtorBalance
74
resolver
CurrentPackTotalToPayDisparity
daiEquivalent
sender
ethToSupply
unapproved
contractAddr
_selfCallContext
impl
_addProto
pending
isTradable
techDevelopmentEthWallet
balances
delegateAllowance
ERC20
FinalizableCrowdsale
"CE"
0x6B175474E89094C44Da98b954EedeAC495271d0F
approveTime
rsub
_depositDharmaToken
totalStake
94
uint128
28
setup_key
unpaidSystemCommission
gof
mintedAmount
addAdminList
setGoldContract
0xb838c100EB1a1d08B215FBbCC06698e9c181358C
delegateIncreaseApproval
_market
newSpecificKey
_rID
userBuyTokenPackNum
onlyAdministrator
closed"
zero
!externalOk
pauseToken
_addresses
P3DAmount
z
mload
isPositive
SafeERC20
_beneficiary
Generic
PacksPurchased
mod
querierAddress
difference
userBuys
UAPCrowdsale
changeList
currentPackTokenPriceBuyout
mulCeil
if
_forSale
_newOwner
attack
currentPackTokenPriceSellout
lastReset
6000
negDelta
_tokensToSell
vault
liquid
dailyTotalEth
renounceOwnership
setAddress
n
_mintFeeDenominator
operators
laff
withdrawalId
getContractTime
Update
receiverAccount
activated"
seasonTradable
t
AllowToUseDisparity
position
_length
baseArrayLength
reLoadXid
getProto
0x3a
ethereumReinvested
_ethereum
0x60
UserBuyFirstPack
SuperCard
getPlayerLAff
"Ownable
registered"
leftChild
_rtcp
whenPaused
rate
newSellPrice
tokenURI
UserTotalAmtDeposit
setAttributeValue
kill
35
0x000000000D38df53b45C5733c7b34000dE0BDF52
globalKey
splitTokens
non
arguments
0xc3
unpauseToken
CardOwnership
OverallDisparityAmounts
value_
limitDateSale
_nameString
DharmaSmartWalletImplementationV7
mintLimit
address"
PausableToken
registerTime
itemKindCount
NewPendingOwner
multiplication
_potAmount
basePrice
callOptionalReturn
feeTransfered
call"
revert
_approvals
addMinter
didSoftCapReached
_own
LexTokenLite
lastIndex
_symbol
mintFeeNumerator
createOnRound
newEscapeHatch
overflow"
TradeDUSDCForDDai
core
claimAddresses
transferWesion
Change
Signed
AddressList
ChangeTrueUSDEvent
312500000000000000000000000
999
managePlayer
setVoteTimesStorage
getBool
dharmaSignature
DSAuthority
"SafeMath
onlyProxyOwner
subtraction
isKYCRequiredToReceiveFunds
uint8
DharmaSmartWalletImplementationV3Interface
Ownable
getGroupKey
sellThisMonthLevel
isWithinLimits
metricsFactory
fromAccount
reqTo
setInt
Link
onlyFsTKApproved
overallDisparityAmounts
mintFeeFlat
EIP20Interface
_upgradeTo
updateMessage
computeTokens
contractBalance
registerNameXIDFromDapp
vitalik
cardIndex
UserBuyDate
change
dailyTotals
89
allIncomeNow
GovWithdraw
weeks
rollBack
div
newMin
_registry
getWithdrawalById
round
"multiplication
parentAddress
addAllowance
requestMint
withdrawAltcoinTokens
getKey
0x40
91
_toAddress
investors
"MUS"
"
SetUserSigningKey
cards
isActivity
cost
creatorOwner
openingTime
BurnableToken
_weights
_contract
reLoadXname
setName
erc20ApproveChecking
deleteInt
_ico1Tokens
newIssuer
_mtkn
valueToGive
0xa1
Operator
get_id
vipLevelLimit
admin2
claimOwnership
saleSupply
plyr_
_ESCAPE_HATCH_REGISTRY
cannot
tradeDDaiForDUSDC
previousOwner
0x20
emergencyAddress
userWithdrawalFromDisparity
amountGivenPEG
transferProxyOwnership
minInvestmentLimit
11
LogSetOwner
_customerAddress
administrators
buyCore
selector
endIcoSaleRound2
10000000000000000000000000
ERC827Token
byte
lockup
TradeEthForDai
totalSupplyCap
safeIncreaseAllowance
_preValidatePurchase
recipient
fraction
67
decreaseAllowance
Mythic
!l
safeTransfer
NewSpecificKey
burnTokens
burnFeeDenominator
ico1Ended
"isDepositAddress"
_mint
"!transferable"
userFirstAmt
totalEthereumBalance
CurrentPackCost
setGovernor
newGlobalKey
_canReceiveMintWhiteList
WithdrawAmount
deleteBool
start
!goalReached
grantAccess
updateTransferability
getInvestor
_withdrawMaxFromDharmaToken
getBytes
001
daiBalance
affiliateID
LogBuy
getCurrentRateInCents
userAmtDepositCurrentPackTRUE
"buy
context
WithdrawTokens
itemid
hours
"!balance
_querierAddress
rootNodeAddress
88
97
UsingConfig
reinvest
registry
depLevel
setRewardDistribution
onlyPayloadSize
getPercentage
mainSaleEndTime
withdrawAmt
pwr
Humanity"
accounts
addresses
onAffiliatePayout
64
transferAll
_saleRate
liquidity
isWithinSaleTimeLimit
playerName
voteCounter
oldValue
0x514910771AF9Ca656af840dff83E8264EcF986CA
type
fetchFunds
getBuyPrice
IssuerContract
availableTokensInPercentage
values
minimumDUSDCReceived
onlyPendingOwner
_tokenAmount
0xdc8e328a3c0acffa7969856957539d0f8c2deaa0d39abaf20397a9fa3b45bf17
finalizeVotes
updateResolver
_getTokenAmount
startStop
onlyAdmin
authority
totalDistributed
block
AddressValidator
"onERC721Received
smart
setEscapeHatch
_getActionID
useraddress
IBasicMultiToken
externalOk
13
_DDAI
create
0x2f
DepositTemp
_kycAddress
_property_decimals
is_contract
setToken
ethIn
setMainSaleDates
_now
2000
AddressConfig
escape
kyc
pushNewMaxOut
burn"
keccak256
bal
newPot
tokenFallback
_temp
50000000000000000
onlyAccessByGame
transfer
_winTID
esToken
paySystemCommissionInvestor
setKYCRequiredToSendTokens
delegateTransfer
ABIEncoderV2
getPlayerAddr
getTotalSellLevel
processIndex
currentVote
to
tokenHolder
onlyRewardDistribution
_withdrawFromDharmaToken
magnitude
lastInvestmentId
"Metal"
_tokenSupply
paused
a
pendingOwner
DSAuthList
burnFeeFlat
AltcoinToken
dTokensToBurn
cardTypes
saleBonus
withdrawals
difficulty
addMinion
suppressRevert
extcodehash
minDeposit
_args4
reasons
setAllowance
_notEntered
provide
gas
vote
X_wallet
Withdraw
voteProcess
dTokenBalance
gods
onlyIfAdmin
userTotalAmtWithdrawal
makePermanantlyTradable
starting
vipPrice
changeRate
foundersKey
_curKeys
state
0xA0b86991c6218b36c1d19D4a2e9Eb0cE3606eB48
"Earth"
55
reward
"your
wad
addedValue
subAllowance
currentRound
ecrecover
flatRate
add
additionNow
signerAccount
!isTransferSuccess
withdrawEther
items
rewardDistribution
who
addSellForParents
ChangeBurnBoundsEvent
action
getUint
TokenPurchase
allDecimals
setBytes
_throughToken
releaseTokens
winnerAddr
myTokens
balanceOfUnderlying
buyToken
delegateTransferFrom
CurrentPackTotalToPay
!mintingFinished
Coin"
80
DelegatedTo
dTokensMinted
0xa4048772583220896ec93316616778B4EbC70F9d
potSwap
"initialized"
pIDxName_
bytes4
74999921875000000000000000000000
OverallRefunded
isOpenRaise
!tryExec
_win
Donate
subtractedValue
proto
userCycle
auth
BasicToken
_aff_3
creationBlock
compressedIDs
ProtoCard
!to
_userSigningKey
otherParticipant
WAD
getTotalSupply
bonus
_input
capReached
GOFTokenWrapper
verifiedAddresses
importMoreInvestors
ERC20Like
_checkRewardRate
tokensMinted
MAX_DEP
getItem
"Arrow"
tokensForCrowdSale
_value
getGlobalKey
endTx
payable
,
EscapeHatch
+=
ERC721TokenReceiver
pull
distribution"
staker
_hardCapInEthers
hmin
emit
is
sell
currentOwner
initialSupply
res
migrateCUSDCToDUSDC
Cancel
refundMoney
denominator
purchases
onWithdraw
NoAdjustment
_payDailyIncomeTimes
saiBalance
!giveEthCharityAddress
newPendingProxyOwner
airdrop
burn
currRound
allBalances
calldata
RemoveEscapeHatch
yet
toBytes
_addressConfig
_REVERT_REASON_HELPER
DSMath
setKYCRequiredToReceiveFunds
onlyApprovedPacks
levelToDown
BrickToken
callResultsBytes
1000000
RevertReasonHelperInterface
itemCounts
wmul
newUserSigningKey
other
validPurchase
"External
investmentId
allIncome
_isApprovedPack
getReturn
_ERC_1271_MAGIC_VALUE
pass
importMoreInvestments
getPower
Property
mul
disableInvestors
excess
"GODS"
unpaid
EverGold
10000000000000000000
MUSystem
_transferMax
safeTransferFrom
UsingStorage
0"
calls
userBuysArray
"deposit
setAuthority
availableTokens
senderAccount
approveToken
finalize
override
rmin
6
purities
AddAdviser
debtorAccount
_dust
SAI
rmax
!isStarted
getBalance
_tokensReceived
_weiAmount
"PoH"
_exchanges
_groupAddr2
getString
onReinvestment
dividendFee_
onlyIssuer
<
!ico2Ended
tokenName
buyerID
150
Staked
_args1
_enabled
RandomnessReceived
finishPayDailyIncome
finalization
acceptOwnership
payDailyIncomeTimes
Vote
no"
Instrument
"Golff
"storage
buyXid
USD
HERO
uint32
expectedValue
.
Pause
userAmtToStore
setVoteTimes
UserTotalAmtWithdrawalCurrentPack
getPlayerVaultsHelper
isTransferSuccess
tokenBalanceLedger_
contributorIndexes
executeActionWithAtomicBatchCalls
Mint
onERC721Received
policy
setStorage
DSExec
uint64
CallSuccess
count
setLiquid0
setMetadata
TokensReturnDecrease
distributionFinished
changeOwner
saleDuration
usdcEquivalent
getItemCount
id
unpause
newPoolPEG
returns
actionID
_approved
nodes
decreaseApprovalAllArgs
index
pc
_operator
getNextPriceAdjustmentTime
userWithdrawalFromFirstRefunded
aboutUser
whitelist
challenge
newImplementation
assembly
Ether
limit
dTokensBurned
_burnFeeDenominator
100000000000000000000
hadd
only
currentInvestor
POOL
userBuyDate
_laff
withdrawDirectDebit
Dharma
_balances
pragma
isBlacklisted
renameList
profit
UserSellDate
!stopped
b
NextPackDelta
getNextGenericActionID
getNonce
68
getReward
paySystemCommissionTimes
_account
DURATION
isStarted
maxOut
wmin
solidity
keyHash
giveEthCharityAddress
5
encodeWithSelector
/
burner
_isNewPlayer
UserWithdrawalFromDisparity
_name
lastPriceAdjustment
w
Pool
revertData
vipProfit
988
Referral
_referralBonus
investments
getShine
priceIsValid
registerNameXname
nextIndex
oneDay
authorized
CardPack
_allowances
constructor
validate3Addresses
"GozePayToken"
isVip
ats
!icoPreEnded
maxOutTimes
ico2Rate
4637
icoPvtEnded
rare
airDropPot_
_amountOfTokens
RefundableCrowdsale
_goldTokenAddress
goalReached
tempEmptyStringTest
tokenPriceBuyout
increaseApprovalAllArgs
_tokenId
hardCap
putWithdrawalsPart1
50000000000e18
uint40
frozen
Querier
Inflate
_changer
myAddress
oldGlobalKey
_CUSDC
updateList
randOne
_fee
"mint"
5000000000000000
m
1'
PotSplit
signatures
_mainSaleEndTime
reqTime
authenticatedCallback
remainsFromDisparity
loopCount
78125000
getPrice
Transfer
division
0x7FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF5D576E7357A4501DDFE92F46681B20A0
addGroup
round_
integration
!=
number
ambassadors_
"governanceRate
calculateTokensReceived
redeemUnderlying
smartWallet
contributorList
_affID
updateReward
win
PEG
finalizeMint
finance
!icoPvtEnded
callResults
62
Dai"
failed"
packSettings
arbitrary
transferFrom
_etherReceived
addSpell
34
tokensIssuedTillNow
_all
{
schema
owner"
daiReceived
setTrueUSD
maximumMaxOutInWeek
sub
already"
reverted
_decodeRevertReason
_child
>>
adminlist
90
cancelledNonce
parent
_minimumReturn
createCard
startIndex
wdiv
uint160
F3Devents
permanentlyDisableEscapeHatch
cEtherUnderlyingEtherBalance
reclaimContract
setSoftCap
getKeyForUser
TokenERC20
9
&
randTwo
tmp
dsp
new
whenNotPaused
weiAmount
onTokenPurchase
setPreSaleTokens
transferAndCall
info
author
25000000000e18
Hatch
39
finney
RefundVault
_ETH_TRANSFER_GAS
isFinalised
c
distributeInternal
setOpenRaise
250
"Spear"
totalEthCharityCollected
low
_getDharmaTokenDetails
underlyingToReceive
ShinyLegendaryPack
_WesionAddr
TGBPController
revivalInvestor
"sorry
mintToken
inflateEtherPool
for
hmul
updateOwner
40
updateTimer
totalSupply_
cancel
strt
provided
validateIllegalAddress
ERC20_Coin
and
op
magicValue
case
95
attempting
importWithdrawals
49
rolledBack
CurrentPackDeposits
deferBlock
indices
100000000000000000000000
_contributerAddress
ico3Ended
0x20c13b0b
swapSaiToDai
big
Owned
_paid
0x58
dEtherUnderlyingEtherBalance
_ret
origin
_rate
ERC20Detailed
CardIntegration
61
setBalance
currentValue
96
71
_addr
totalSell
_SAI
Withdrawal
call
no
calculateMaxRewardsPerBlock
TimedCrowdsale
setAdmin
Consume
_getRarePlusRarity
setOwner
transferKycOwnerShip
addressValidator
presenterAddress
int
purity
mintFeeDenominator
payWithNoMaxOut
"SuperCard"
_com
method"
malformed
transferFee
src
IncreaseNonce
SendEth
registerNameXnameFromDapp
transferAmount
CurrentPackTotalAmt
maxWithdraw
already
0x79
ECDSA
oneNumbers
998345
SPELL
NameFilter
14
requestingWithdrawalAddress
tokensToEthereum_
message
reverted"
deposit
imin
WesionDevelopersFund
65
ERC827
43
_p3d
110000000
10e18
UserBuyTokenPackNum
!seasonTradabilityLocked
currentPackDeposits
setMetricsFactory
setHardCap
rndMax_
PropertyGroup
checkOpen
approved
"Dai
burnMin
spenderInstrument
dailyTotal
break
12
Essence
_burnFrom
MintableToken
resetSystemCommision
incomingEthereum
mintViaCToken
_setFullApproval
beforeBalanceChange
_impl
!ico1Ended
bytesStorage
_CDAI
onWithdrawAndDistribute
ChangeStakerEvent
ico2Tokens
isGroup
random
BrickStarted
DTokenInterface
validate
balance
thisBal
CallFailure
notContract
GOFLINKPool
the
EscapeHatchDisabled
rescueTokens
currentDaiBalance
issuer
_data
_create
withdrawal
setDelegate
withdrawDai
NoOwner
BrickTokenPurchase
_tos
wadd
isFinalized
setPolicyFactory
onlyAmbassadors
Treasure
systemCommission
blackList
wallet
newStaker
_tokenWallet
deleteString
ok
specificKey
reclaimToken
73
uint24
etherBalance
getNameFee
min
addPack
1e12
_affID_1
commit
_openingTime
!address
depositProcess
hmax
300000000000000000000000000000000
30
0x4d0B70d8E612b5dca3597C64643a8d1efd5965e1
CanDelegate
increaseApprovalAndCall
endRound
UseItem
_pearn
_startTime
_target1
splitNumbers
999999
setLiquid
ethereumEarned
constant
<<
MAX_UINT256
directDebit
AccessByGame
StandardToken
dailyTotalToken
setSaleDuration
epic
notThis
eta
notifyRewardAmount
"redeem"
totalPoint
"\x19Ethereum
returndatacopy
0x61
33333
"Bamboo
should
"capped"
calculatePrice
_depositOnCompound
isSenderApprovedFor
pendingProxyOwner
bytes16
limits
_contractStartAt
decreased
votingEndBlockNumber
_burner
from
nullValue
buyVip
health
getGenericAtomicBatchActionID
dDaiToSupply
claimed
return
space"
_eth
getSpecificKey
IMarket
getItemKindCount
vipBasePrice
EscapeHatchModified
"!deposit
userList
setIssuer
invest
300000e18
cTokensToSupply
response
burnFeeNumerator
_setUserSigningKey
collect
IS_KYCRequiredToReceiveFunds
Escaped
ono
"ERC20
forwardAllRaisedFunds
18
voteCounterStorage
usdcAllowance
removeWhiteList
ERC20Basic
0x8b65236d01ab5274303220d4c78b02ef7685ca757275036fc104f62fbe6e10a7
!distributionFinished
require
transferBatch
new_haash
metadata
finaliseCrowdsale
as
FinalisedCrowdsale
_JUST_UNDER_ONE_1000th_USDC
_DHARMA_KEY_REGISTRY
deltaSupply
F3Ddatasets
balance"
98
_return
private
AdminshipTransferred
uIntStorage
-=
donate
_checkDharmaTokenInteractionAndLogAnyErrors
mainSaleStartTime
custom
reason
_address
withdrewAmount
"Mutual
currentPackNumber
playerID
removeAddress
Account
decreaseApproval
"transfer"
boolStorage
contractStartAt
"Compound
cnt
withdrawAddress
ReentrancyGuard
CurrentPackTokenPriceBuyout
determinePID


isAct
revertReason
"Brick"
levelToUp
40000
WithdrawAccount
getInvestmentById
between
code
IGroup
Unbundle
78
0x2c1564A74F07757765642ACef62a583B38d5A213
createFirstRound
_transferETH
sload
reclaimEther
totalDailyIncome
_vault
lastTimeRewardApplicable
querierAdmin
owners
aboutCurrentPack
_etherInUSD
canReceiveMintWhiteList
currentPackStartDate
codehash
allWeights
data_
Address
potSplit_
0x733Fa571c2Db987dbdB7767FaBF8392300f456d6
policyFactory
Card
safeDiv
signature
subBalance
msgSender
_target2
nextPriceAdjustmentTime
ra
_numberOfRounds
DharmaSmartWalletImplementationV6Interface
contributionAmountViewOnly
NewUserSigningKey
44
availableAmountToDepositInWei
24
0x81
antiEarlyWhale
super
softCap
31
adds
gasleft
extcodesize
usdcBalance
_preSaleTokens
currentCall
continue
_getShinyPurity
amountPaid
0x00000007A394B99baFfd858Ce77a56CA11e93757
"string
amtForfirstRefund
00000001
Burn
50
sig
withinPeriod
j
setAllocatorStorage
batchAddAddresses
0x5d3a536E4D6DbD6114cc1Ead35777bAB948E3643
isRemoving
"Proof
infoUrl
blockhash
"unauthorised
_recipient
ownerOf
authority_
purityTwo
approveAllArgs
running
setInitialValue
vipMap
userBuyFirstDate
allTokensDecimalsBalances
wAmtToCurrentPack
cToken
1000000000
admin
newProxyOwner
unpaidSystemCommissions
_referredBy
multiSigWithdrawal
ProxyOwnershipTransferred
++
hatch
operatorAddress
canUseDirectDebit
buyTokens
oldDepositedAmount
_to
NextPack
Escape
tokensBurned
getNodesAddresses
intStorage
delegatedFrom
magic
tradeEthForDaiAndMintDDai
at
0x5ADF43DD006c6C36506e2b2DFA352E60002d22Dc
buy
_undividedDividends
LogClaim
durability
!exists
requestChangeWithdrawAddress
ambassadorMaxPurchase_
RAY
registerDepositAddress
Proxy
SecureERC20
tx
_firstRoundSupply
59
"EXI"
_noFeesList
ChangeStakingFeesEvent
claim
dai
_rttcp
addressToSendTo
unbundleSome
DharmaSmartWalletImplementationV8Interface
transferList
_forwardFunds
foundersAllocation
setQuerier
!blackList
0xffffffffffffffffffffffff
_totalSupply
splitAddresses
Upgraded
isRunnning
updateSaleRate
userTotalAmtDepositCurrentPack
Cycle
i
team
setCanClaim
_withdrawFromCompound
tokenOwner
!priceIsValid
sqrt
[
getNextGenericAtomicBatchActionID
on
isAddressVerified
setTimeBetweenPriceAdjustments
0x7b
"BRK"
dharmaSigningKey
_decimals
governanceRate
name
isAccount
CurrentPackDisparityAmounts
NextPackTokenPriceBuyout
putWithdrawalsPart2
"division
newBuyPrice
size
oldEscapeHatch
from_
anonymous
shiftedAddress
implementationPosition
SaiToDaiMigratorInterface
0xc73e0383F3Aff3215E6f04B0331D58CeCf0Ab849
_groupAddr1
_msgSender
_updatedPayouts
transferOwnership
delete
spender
y
delegator
toEthSignedMessageHash
getWithdrawalsLength
_gen
difficult
setLockup
_tokenHolder
_updatePurchasingState
packable
onlySender
string
packs
Stablecoin"
useFromDisparity
uris
"no
common
deleteUint
oneAddresses
struct
924890
activate
_getPurity
value"
Bundle
burned
SetIssuer
clear
hash
int256
_lastPayDailyIncome
_ACCOUNT_RECOVERY_MANAGER
self"
1000000000000000000
WithdrawDirectDebitFailure
result
NamableAddressList
setSaleBonus
_migrateCTokenToDToken
deleteAddress
ico1Rate
Math
Crowdsale
period
withdrawAmtAboveCurrentPack
implementsERC721
buyPrice
advisoryEthWallet
1200000
getMaxOuts
hmmm
_taxedEthereum
TerminateDirectDebit
"pocket
84
ambassadorAccumulatedQuota_
esCrowdsale
dUSDCReceived
lastUpdateTime
same
below
userTokensReturnAboveCurrentPack
restart
63
PrevPackTokenPriceBuyout
Not
"approve"
8
CanReclaimToken
view
TeamFee
rmul
1010101010
0x0000000000DfEd903aD76996FC07BF89C0127B1E
ApprovalForAll
ERC721Enumerable
propertyFactory
Player
0x536D36a05F6592aa29BB0beE30cda706B1272521
address
pIDxAddr_
ApproveAndCallFallBack
_currentPackNumber
"!recipient
calcUnMaskedEarnings
DharmaEscapeHatchRegistryInterface
isDisableds
currentUserCount
allowancePEG
ONOSale
peek
executeAction
OverallWithdrawals
HasNoEther
nextSeason
_tradeEthForDaiAndMintDDaiAtomic
Call
"Could
"Only
"USDC
MIN_DEP
activated_
29
amountAddedToPot
dDaiUnderlyingDaiBalance
when
migrateCSaiToCDai
addProto
cUsdcUnderlyingUsdcBalance
setMagage
_getCTokenDetails
setSymbol
currentTokenSupply
userTokenObtain
ERC721
importing
changeName
remainsFromFirstRefunded
CardBase
748
start"
plyrRnds_
3000
tokensToSell
PresalePack
v
isWithinSaleLimit
transaction
proxyOwner
unbundle
uint
getGenericActionID
default
amounts
'v0
reqAmount
accountHash
predictPacks
_oldAddress
removeFromWhitelist
25
divCeil
canAcceptTokens_
hasDisabledEscapeHatchForSmartWallet
checkStart
5000000000
DepositAddressRegistered
ethereumToTokens_
`to`
77
_wallet
sstore
presentee
currentWithdrawAccount
RewardAdded
"zero
minters
pos
investorAddresses
ethereumWithdrawn
Passes"
canTriggerPriceAdjustment
rawCallResults
"DAI
DepositAddressRegistrar
owner
0x780e9d63
UserSellTokenPackNum
bestAmount
numberOfDay
d
bonusToSend
minimumDaiReceived
maxLength
up
_exchanges"
onList
totalTokens
fax
LogSetAuthority
toEnable
_allowance
getInvestmentsByIndex
10000000000000000000000000000000000000000000000000000
_revertReason
_index
CurrentPackTokenPriceSellout
l
OwnershipRenounced
cardType
_blackList
FailedAdjustment
god
purchase
charityFee_
gotPEG
fstkAuthority
rndInit_
"withdraw
contractAccess
DharmaSmartWalletImplementationV9
"Dharma
addAddress
!userSigningKey
CurrentPackYield
_isAct
(
Owner"
_setPendingUpgradeabilityOwner
1000
0xE24257338d0c15f3Dd00Ed59fcA9e50CfB167bA8
allowanceAmount
_newEth
underlyingToSupply
CardCreated
minPrice
ownsAll
registerNameXID
57
voteTimes
10
hasClosed
buyPhaseTokens
functionName
93
_setImplementation
subCountOf
10000000000000000000000000000000
ethOut
0X"
etherInUSD
newAllowance
migrateCDaiToDDai
exchangeRateCurrent
Message
calldatacopy
Governable
pause
WithdrawTemp
setAllowanceSheet
Context
setTokenAddress
DirectDebitInfo
IS_KYCRequiredToSendTokens
setRaisePrice
_itemid
presenteeAddress
setBalanceSheet
setPvtTokens
/=
_canBurnWhiteList
usdcNaughty
_admin2
name_
rID_
IS_DEPOSIT_ADDRESS
times
tryExec
120
Refunded
isBenefeciary
season
consecutive
value
"its
_minReturn
withdrawAccount
!isFinalised
getPoolBalances
"Exchange
SetFsTKAuthority
82
40000000
goal
payWithMaxOut
ItemToken
Unchained"
getCard
symbol_
_postValidatePurchase
76
errorMessage
"GZPT"
"v0
TrueUSD
setStakingRequirement
opIndex
!hasStarted
receiver
fee
amount"
current
forwardFunds
setTokensForCrowdSale
MintOperation
withinCap
finishDistribution
amountWon
USDC
JiggsR
"dev
icoGen
LogMint
rndExtra_
_integration
45
_validateActionAndIncrementNonce
-
Fraction
contributionAmount
_approve
previousPoolSize
_metrics
"Jiggs
HasNoContracts
EXI
set"
DharmaSmartWalletImplementationV1Interface
_softCap
numbers
_prize
transferAllArgsNoAllowance
_transferFeeNumerator
note
owner_
"!zero
iszero
getNextCustomActionID
!verifiedAddresses
92
devToken
21
deleteBytes
strict
MintOperationEvent
packIndex
ERC20Interface
_DAI
19
keysRec
"!reset"
burnMax
!ico3Ended
stringStorage
setLists
wallet_id
onlyIfWhitelisted
_getDharmaSigningKey
safeDecreaseAllowance
DharmaSmartWalletImplementationV4Interface
in
0x39AA39c021dfbaE8faC545936693aC917d5E7563
DSAuthEvents
call_ret
"cDai
register
_sender
_newAddress
"balanceOf"
ambassadorQuota_
rarityRandom
createStorage
or
setWithdrawStorage
_USDC
getInvestorLength
numbers"
_rIDlast
26
getRandomCard
maxOutIds
FsTKAuthority
canBurnWhiteList
openRaise
makeUntradable
numDays
encodePacked
Legendary
20000
130
Epic
_target
createAndAuthenticate
86
calling
Closed
reqAddress
Round
CurrentPackRestAmt
_mainSaleStartTime
time
ERC20Standard
profitOf
setPolicy
_totalSupplyCap
getOraclePriceETH_USD
setApprovalForAll
let
getWithdrawalsByIndex
signer
17
999999999999999
makeCall
getNextEthForDaiActionID
_toToken
0x30
"Must
createTokenContract
tokenSendFailuresCount
AllowanceSheet
bool
too
0x6466353c
DharmaSmartWalletImplementationV7Interface
"not
isWithinTokenAllocLimit
updateMasks
userAvailableAmount1
rdiv
paySystemCommissionByIndex
functionSelector
"CryptoEssence"
"already
userAmt
_p1
_ethereumToSpend
only"
compressedData
SetEscapeHatch
ready
setERC20ApproveChecking
canClaim
hdiv
down
_ico2Tokens
getAllIncomeTilNow
saiToSwap
presentees
failure"
addBalance
userTotalAmtDeposit
isAuthorized
!investors
lint
bonusAmountRefunded
lrnd
rndInc_
tribe
_getEpicPlusRarity
PEG"
DSAuth
eth
56
library
cUSDCUnderlyingUSDCBalance
keys
may
founderAddr
this
icoPvtRate
amountGivenEther
47
UserAmtDepositCurrentPackTRUE
investorsCount
_DUSDC
Claimable
releaseAllTokens
81
than
AcceptsProofofHumanity
mstore
contractInst
_subtractedValue
_author
proposed
previousBalances
keysBought
affiliateAddress
distributeInvest
tradeEthForDai
recovery
mismatch"
send
min12
bytes32
seed
actionNonce
price
_ppt
319500000
"Water"
mintBatch
addWeapon
_amountOfEthereum
33
RestartModeDate
_pass
KycContractInterface
payStakingFee
6000000
endPreSale
eternalStorage
getInt
DAIWithdrawal
"BTT"
_removeToken
ownerAccount
_spender
disableInitialStage
101
0x89d24A6b4CcB1B6fAA2625fE562bDD9a23260359
of
_tokens
Rarity
_executeActionWithAtomicBatchCallsAtomic
getOwnedTokens
enabled
"!resolver"
"vip
getItemCounts
"cSai
iWantXKeys
exists
_racp
addItem
calcKeysReceived
daiAllowance
set
previousAdmin
0x"
votes
_newTime
frozenAccount
totalSellLevel
playerAddress
!suppressRevert
setLimit
_dividends
version
getWithdrawAddress
returnData
mulDivCeil
requestReclaim
27
KycContract
buffer
userBuyFirstPack
bundleFirstTokens
41
_validator
calldatasize
_gunit
"TrueUSD"
noPoint
ids
userAmtOverloadToSend
escapeHatch
reduceAmount
+
EthWithdrawal
amountToReserve
onlyBagholders
_ensureValidGenericCallTarget
stake
encode
registerNameXaddrFromDapp
"Gods
0xc5d2460186f7233c927e7db2dcc703c0e500b653ca82273b7bfad8045d85a470
75000000000000
end
ownedTokens
_tokensForCrowdsale
setRate
"Wood"
)
blacklisted
asset
issueClaimOwnership
rewards
USDCV1Interface
currentImplementation
withdrawAmtToCurrentPack
"EXInteractive"
transferFeeNumerator
dst
CurrentPackFee
delegateTotalSupply
!paused
currentWithdrawalAddress
_invest_return
currency"
toApprove
closingTime
_saleDurationInDays
tokensIssued
sq
healths
0xbc67B82924eEc8643A4f2ceDa59B5acfd888A967
_key
uint16
instruments
Killable
customerAddress
"EG"
err
toGive
externalID
_power
p3d
stopped
delegateApprove
!initialized
blocksDelay
CappedCrowdsale
balanceETH
1
maxLevelsAddSale
"!forSale"
failed
currentSeason
protos
operator
modifier
OwnableToken
PropertyFactory
83
_TRADE_HELPER
marketGroup
1599652800
600000
setAdministrator
Item
addressStorage
IERC20
balanceOf
_values
withdrawStorage
gen
isOpen
getUnpaidSystemCommission
balanceResolution
_rm
governor
tokenByIndex
10000
setItemAvailable
EventReturns
ERC827Caller
15
cDaiUnderlyingDaiBalance
tokenPriceInitial_
UserTotalAmtDepositCurrentPack
validateGroup
onlyStronghands
getComponents
getDepositLevel
underlyingBalance
rarity
ERC165
"!owner"
spendableAllowance
"Caller
getPlayerName
NewVip
lastMaxOut
ownerSupply
withdrawalIds
Tournament
implementation
hasEnded
playerNames
holder
addr
bundle
LogCollect
!frozenAccount
repayAndDeposit
_args3
close
UserFirstAmt
exit
mintOperations
;
986765
decreaseApprovalAndCall
xor
CTokenInterface
_config
CurrentPackStartDate
getCurrentRoundInfo
use
origSender
"No
Investor
MaxOut
referredBy
isDirectDebitEnable
_nonce
returnTokenInCurrentPack
receive
100000000000000000000000000
pendingProxyOwnerPosition
48
getBurnCount
stringToBytes32
DSNote
nonceToCancel
_token
^
CappedVault
calldataload
amountBurned
genAmount
tokenContract
"can't
SmartToken
Program"
setCanAcceptTokens
depositedAmountGross
lastPaySystemCommission
DSToken
addWhiteList
minimumActionGas
delegatecall
enableInvestor
AssetType
_total
balancePEG
average
ico2Ended
migrateSaiToDai
"TUSD"
flag
govWithdrawEther
disableInvestor
0xE40FFEA88309174321ef230e10bfcCC7c2687f76
_tokenPriceInitial
0xFEb461A778Be56aEE6F8138D1ddA8fcc768E5800
debtor
_withdrawDaiAtomic
getVersion
delegate
plyrNames_
onTokenSell
"None"
activate"
Common
tokens
tokenAddr
0x5b5e139f
verifyTeam
wipeBlacklistedAccount
0x00000000001876eB1444c986fD502e618c587430
sellThisMonth
_transfer
getMaxOutsLength
4999
authenticate
256
contain
new_hash
getPlayerID
must
open
redeemAmount
_res
_gov
updateRateInWei
sellToPaySystemCommission
buyXaddr
startTime
_tokenAddress
level
52
input"
modulo
test
UserBuyFirstDate
_foundersAllocation
ethRec
beneficiary
insufficient
setPropertyGroup
nextInvestors
updateGenVault
Finalized
rewardPerTokenStored
255
32
invalid
lastPayDailyIncome
PlayerBookInterface
"Ever
0x44d44CA0f75bdd3AE8806D02515E8268459c554A
isApproved
Investment
release
onReLoadAndDistribute
currentSaiBalance
_from
payer
metricsGroup
reserveCommission
Approval
36
r
_air
_charityPayout
exec
ETH
_JUST_UNDER_ONE_1000th_DAI
contains
validateAddress
!success
winnerName
buyNum
3
hasAttribute
IAllocator
batchTransfer
characters"
symbol
supplied
ended
debit
100
75
init
safeAdd
currentVipCount
_prop
BalanceSheet
UpgradeabilityProxy
=
isOwner
0x0
openTime
_setUpgradeabilityOwner
distributeExternal
Gold"
functions
ben3
increaseApproval
withdrawAccounts
ONO
OverallDeposits
payCharity
isMinter
hsub
rand
account
"Recipient
nextInvestor
submitter
_lastPaySystemCommission
"Sai
tokenPriceIncremental_
setupDirectDebit
addProtos
purchaser
_owner
newAdmin
_diagnoseAndEmitUSDCSpecificError
userTotal
mintAmount
exceeds
killYourself
payoutsTo_
ProofofHumanity
 
totalPaidAfterThisTime
tribes
allowance
tokenPriceSellout
userAvailableAmount
calculateEthereumReceived
overallDeposits
list
mustBeAdmin
removeEscapeHatch
Active
isSoftCapHit
"_group"
!isFinalized
decimals
lastId
Cannot
investorAddress
switch
UAPToken
isApprovedForAll
totalEthCharityRecieved
ETHWithdrawal
_mintFeeNumerator
createPerRound
500000000e18
"Insufficient
DharmaSmartWalletImplementationV0Interface
pure
transferAnyERC20Token
diff
investorCount
setUserSigningKey
validateAddresses
balanceCheckWorked
roundFor
_metadata
_hasNonNumber
purityOne
withdrawAll
wAtoStore
SetDirectDebit
"Invalid
"illegal
referralBalance_
referrer
86400
42
DharmaKeyRegistryInterface
998
setGlobalKey
dUsdcUnderlyingUsdcBalance
onlyOwner
icoAvg
gotEther
payDailyIncomeByIndex
burnCount
depCP
_groupAddr
push
setMaximumMaxOutTimes
_aff_eth
58
initialSuppy
withdrawUSDC
data
isDisabled
lockupStorage
isActivated
_mintFeeFlat
DSStop
rpow
processInvestments
depositFor
38
owned
RestartMode
"!transfer"
initialized
randomness
allocator
_affID_2
totalCount
extract
initialAddress
tokenSupply_
underlyingReceived
_withdrawUSDCAtomic
"cUSDC"
12000000
withdrawETH
bytes
purchaseTokens
canMint
37
FrozenFunds
